Reports/ДиаграммаСостоянийРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ДиаграммаСостоянийРаботников</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Болезни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Командировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отпуска</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прогулы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппировкиОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяГруппировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеГруппировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеГруппировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтборыОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОтбора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеФильтра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказателиОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоказателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПоказателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПоказателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>400</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сортировка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИтоговоеПоле</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/СостояниеРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостояниеРаботниковОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СостояниеРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СостояниеРаботников</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРаботникаОрганизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаСНефиксированнымРабочимВременем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКЗоТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненийИзОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Работники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>Работники</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВУпрУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаУвольнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ДиаграммаСостоянийРаботников/Ext/ObjectModule.bsl
#Если Клиент Тогда
Перем мИмяОтчета Экспорт;				// Имя этого отчета
Перем мКодОтчета;// Код отчета

// Периодичности
Перем мЧасДень Экспорт;
Перем мДеньНеделяМесяц Экспорт;
Перем мНеделяМесяцГод Экспорт;
Перем мМесяцГод Экспорт;

// Список значений, имена отборов построителя отчета, которые задаются по умолчанию 
Перем мСписокГруппировки;

// Список значений, имена отборов построителя отчета, которые задаются по умолчанию
Перем мСписокОтборы;

// Таблица доступных видов отчета
Перем мТаблицаВидыОтчета Экспорт;

// Коды видов отчета
Перем мОрганизация Экспорт;
Перем мПредприятие Экспорт;


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// 

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

// Вывод строки отчета (с проверкой необходимости этого вывода)
//
// Параметры:
//	Выборка       - выборка из результата отчета, которая обходится в процедуре
//	СтруктураПараметров - структура параметров, необходимых для вывода строки
//	Номер         - число, номер обходимой группировки
//	ДопСтрока 	  - строка, выводится справа от группировки. по умолчанию пустая
//
Функция ВывестиСтрокуГруппировки(Выборка, СтруктураПараметров, ТочкаРодитель)

	Если ТочкаРодитель = Неопределено Тогда
		СтруктураРодитель = Новый Структура;
	Иначе
		СтруктураРодитель = ТочкаРодитель.Значение
	КонецЕсли;

	СтруктураГруппировок = Новый Структура;
	Для каждого Элемент Из СтруктураРодитель Цикл
	    СтруктураГруппировок.Вставить(Элемент.Ключ,Элемент.Значение)
	КонецЦикла;
	
	ИмяГруппировки  = Выборка.Группировка();
	ЗначениеГруппировки = Выборка[ИмяГруппировки];
	СтруктураГруппировок.Вставить(ИмяГруппировки,ЗначениеГруппировки);
	
	Попытка 
		ПредставлениеГруппировки = "" + Выборка[ИмяГруппировки + "Представление"];
	Исключение
		ПредставлениеГруппировки = "" + Выборка[ИмяГруппировки];
	КонецПопытки;	
	
	Если ПустаяСтрока(ПредставлениеГруппировки) Тогда
		ПредставлениеГруппировки = "<...>";
	КонецЕсли;
	
	Диаграмма = СтруктураПараметров.Диаграмма;
	Точка = Диаграмма.УстановитьТочку(СтруктураГруппировок, СтруктураРодитель);
	Точка.Расшифровка = ЗначениеГруппировки; 
	Точка.Текст = ПредставлениеГруппировки;
	
	Возврат Точка;
	
КонецФункции // ВывестиСтрокуГруппировки()

// Вывод отрезков диаграммы.
// Параметры:
//	Выборка -       Выборка из результата запроса по периоду
//	СтруктураПараметров - структура общих параметров
//	ИмяПоказателя - Имя поля показателя. По умолчанию "РесурсЧисло".
//	ЦветОтрезка - Цвет. Если задан, отрезки будут окрашены таким цветом, иначе - цветом из макета
//
Процедура ВывестиИнтервалы(Выборка, СтруктураПараметров, Точка)

	Диаграмма = СтруктураПараметров.Диаграмма;
	
	Пока Выборка.СледующийПоЗначениюПоля("Серия") Цикл
		
		Серия = СтруктураПараметров["Серия" + Выборка.Серия];
		МассивТочек = Диаграмма.ПолучитьЗначение(Точка, Серия);										
		
		Пока Выборка.Следующий() Цикл
			
			// Если построение слишком долгое, например, выбрана слишком мелкая периодичность, 
			// то его можно прервать (Ctrl+Break)
			ОбработкаПрерыванияПользователя();
			
			НачИнтервала = Макс(Выборка.НачалоИнтервала, ДатаНач);
			КонИнтервала = ?(Выборка.КонецИнтервала = NULL, ДатаКон, Мин(Выборка.КонецИнтервала, ДатаКон));
			
			Интервал = МассивТочек.Добавить();
			Интервал.Начало = НачИнтервала;
			Интервал.Конец 	= КонИнтервала;
			Интервал.Расшифровка = Выборка.Регистратор;
			Если Периодичность = мЧасДень Тогда
				Интервал.Значение.Текст = ""  + Формат(НачИнтервала, "ДФ='ЧЧ:мм дд.ММ'") + " - " + Формат(КонИнтервала, "ДФ='ЧЧ:мм дд.ММ'");
			Иначе	
				Интервал.Значение.Текст = ""  + Формат(НачИнтервала, "ДФ=dd.MM.yyyy") + " - " + Формат(КонИнтервала, "ДФ=dd.MM.yyyy");
			КонецЕсли; 
			
			// добавим текущий интервал во все родительские точки
//			ТочкаРодитель = Точка.Родитель;
//			Пока ТочкаРодитель <> Неопределено Цикл
				
//				МассивТочекРодителя = Диаграмма.ПолучитьЗначение(ТочкаРодитель, Серия);										
//				ИнтервалРодителя = МассивТочекРодителя.Добавить();
//				ИнтервалРодителя.Начало = НачИнтервала;
//				ИнтервалРодителя.Конец = КонИнтервала;
				
//				ТочкаРодитель = ТочкаРодитель.Родитель;
//			КонецЦикла; 
			
		КонецЦикла; 
	КонецЦикла; 
	

КонецПроцедуры

// Обход выборки из результата запроса по группировкам для вывода строк отчета
//
// Параметры:
//
//	Выборка       - выборка из результата отчета, которая обходится в процедуре,
//	СтруктураПараметров - структура параметров, передеваемых в процедуру вывода
//	                строки отчета,
//	Номер         - число, номер обходимой группировки
//
Процедура ВывестиВыборку(Выборка, СтруктураПараметров, Номер, ТочкаРодитель = Неопределено)

  	Состояние(НСтр("ru='Вывод отчета';uk='Виведення звіту'"));
	ОбработкаПрерыванияПользователя();

	ВсегоГруппировок = СтруктураПараметров.ВсегоГруппировок;
	
	// Берутся группировки все подряд
	Пока Выборка.Следующий() Цикл

		ПоследняяГруппировка = (Номер = ВсегоГруппировок-1);
		
		// Для каждого значения группировки строим строку диаграммы
		Точка = ВывестиСтрокуГруппировки(Выборка, СтруктураПараметров, ТочкаРодитель);
		
		Если НЕ ПоследняяГруппировка Тогда
			ВывестиВыборку(Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам), СтруктураПараметров, Номер + 1, Точка);
		Иначе	
			ВыборкаДетальныхЗаписей = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
			ВывестиИнтервалы(ВыборкаДетальныхЗаписей, СтруктураПараметров, Точка);
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры // ВывестиВыборку()

// Формирует текст основного источника данных для построения диаграммы
Функция ПолучитьТекстОсновнойВыборкиДляВидаДиаграммы(КодОтчета, Состояние ,ТекстОграничениеПериода)

	Если КодОтчета = мОрганизация Тогда
		ВыборкаДат = "
		|			ВЫБРАТЬ
		|				СостояниеРаботниковОрганизации.Сотрудник,
		|				СостояниеРаботниковОрганизации.Регистратор,
		|				СостояниеРаботниковОрганизации.Период КАК НачалоИнтервала
		|			ИЗ
		|				РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизации
		|
		|			ГДЕ
		|				Состояние = &"+Состояние+" " + ?(ТекстОграничениеПериода <> ""," И " + ТекстОграничениеПериода,"");

		Если ТекстОграничениеПериода <> "" тогда
			ВыборкаДат = 		ВыборкаДат + "
			|
			|			ОБЪЕДИНИТЬ ВСЕ
			|
			|			ВЫБРАТЬ
			|				СостояниеРаботниковОрганизацииСрезПоследних.Сотрудник,
			|				СостояниеРаботниковОрганизацииСрезПоследних.Регистратор,
			|				СостояниеРаботниковОрганизацииСрезПоследних.Период Как НачалоИнтервала
			|			ИЗ
			|				РегистрСведений.СостояниеРаботниковОрганизаций.СрезПоследних(&ДатаНач) КАК СостояниеРаботниковОрганизацииСрезПоследних
			|			ГДЕ
			|				СостояниеРаботниковОрганизацииСрезПоследних.Состояние = &"+Состояние+"
			|			";
		КонецЕсли;
		
		ОсновнаяВыборка = "
        |		//Запрос на получение периодов
		|		ВЫБРАТЬ
		|			ДатыУхода.Сотрудник,
		|			ДатыУхода.Регистратор,
		|			ДатыУхода.НачалоИнтервала,
		|			Выбор Когда ДатыВозврата.КонецИнтервала Есть Null Тогда &ТекущаяДата Иначе ДобавитьКДате(ДатыВозврата.КонецИнтервала, СЕКУНДА, -1) Конец КАК КонецИнтервала
		|		ИЗ (" + ВыборкаДат + ") КАК ДатыУхода
		|		ЛЕВОЕ СОЕДИНЕНИЕ (
		|   		//Запрос на получение дат возврата из отпуска
		|			ВЫБРАТЬ
		|				ДатыУхода.Сотрудник,
		|				ДатыУхода.НачалоИнтервала,
		|				Минимум(СостояниеРаботниковОрганизации.Период) КАК КонецИнтервала
		|			ИЗ (" + ВыборкаДат + ") КАК ДатыУхода
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРаботниковОрганизации
		|			ПО	СостояниеРаботниковОрганизации.Сотрудник = ДатыУхода.Сотрудник И СостояниеРаботниковОрганизации.Период > ДатыУхода.НачалоИнтервала	
		|			СГРУППИРОВАТЬ ПО ДатыУхода.Сотрудник, ДатыУхода.НачалоИнтервала
		|		) КАК ДатыВозврата
		|		ПО ДатыВозврата.Сотрудник = ДатыУхода.Сотрудник И ДатыВозврата.НачалоИнтервала = ДатыУхода.НачалоИнтервала
		|		";	

	Иначе
		ВыборкаДат = "
		|			ВЫБРАТЬ
		|				Сотрудники.Ссылка				КАК Сотрудник,
		|				СостояниеРаботников.Период КАК НачалоИнтервала,
		|				СостояниеРаботников.Регистратор
		|			ИЗ
		|				РегистрСведений.СостояниеРаботников КАК СостояниеРаботников
		|				ЛЕВОЕ СОЕДИНЕНИЕ
		|					Справочник.СотрудникиОрганизаций КАК Сотрудники
		|				ПО 
		|			      	Сотрудники.ФизЛицо = СостояниеРаботников.ФизЛицо
		|
		|			ГДЕ
		|				Состояние = &" + Состояние + " " + ?(ТекстОграничениеПериода <> ""," И " + ТекстОграничениеПериода,"");

		Если ТекстОграничениеПериода <> "" тогда
			ВыборкаДат = 		ВыборкаДат + "
			|
			|			ОБЪЕДИНИТЬ ВСЕ
			|
			|           //Срез находящихся в отпуске на дату начала периоду
			|			ВЫБРАТЬ
			|				Сотрудники.Ссылка						КАК Сотрудник,
			|				СостояниеРаботниковСрезПоследних.Период КАК НачалоИнтервала,
			|				СостояниеРаботниковСрезПоследних.Регистратор
			|			ИЗ
			|				РегистрСведений.СостояниеРаботников.СрезПоследних(&ДатаНач) КАК СостояниеРаботниковСрезПоследних
			|				ЛЕВОЕ СОЕДИНЕНИЕ
			|					Справочник.СотрудникиОрганизаций КАК Сотрудники
			|			    ПО
			|					Сотрудники.ФизЛицо = СостояниеРаботниковСрезПоследних.ФизЛицо
			|			ГДЕ
			|				СостояниеРаботниковСрезПоследних.Состояние = &" + Состояние + "
			|			";
		КонецЕсли;	 

		ОсновнаяВыборка = "
		|		ВЫБРАТЬ
		|			ДатыУхода.Сотрудник,
		|			ДатыУхода.Регистратор,
		|			ДатыУхода.НачалоИнтервала,
		|			Выбор Когда ДатыВозврата.КонецИнтервала Есть Null Тогда &ТекущаяДата Иначе ДобавитьКДате(ДатыВозврата.КонецИнтервала, СЕКУНДА, -1) Конец КАК КонецИнтервала
		|		ИЗ (" + ВыборкаДат + ") КАК ДатыУхода
		|		ЛЕВОЕ СОЕДИНЕНИЕ (
		|			ВЫБРАТЬ
		|				ДатыУхода.Сотрудник,
		|				ДатыУхода.НачалоИнтервала,
		|				Минимум(СостояниеРаботников.Период) КАК КонецИнтервала
		|			ИЗ (" + ВыборкаДат + ") КАК ДатыУхода
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостояниеРаботников КАК СостояниеРаботников
		|			ПО	СостояниеРаботников.ФизЛицо = ДатыУхода.Сотрудник.ФизЛицо И СостояниеРаботников.Период > ДатыУхода.НачалоИнтервала	
		|			СГРУППИРОВАТЬ ПО ДатыУхода.Сотрудник, ДатыУхода.НачалоИнтервала
		|		) КАК ДатыВозврата
		|		ПО ДатыВозврата.Сотрудник = ДатыУхода.Сотрудник И ДатыВозврата.НачалоИнтервала = ДатыУхода.НачалоИнтервала
		|		";

	КонецЕсли;	
		
	Возврат ОсновнаяВыборка;
КонецФункции	

// Возвращает код отчета в зависимости от вида отчета
Функция ПолучитьКодОтчета() Экспорт 
	Возврат мТаблицаВидыОтчета.Найти(ВидОтчета, "ВидОтчета").КодОтчета;
КонецФункции // ПолучитьКодОтчета()


///////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Выполняет настройку отчета по умолчанию для заданного вида отчета
//
// Параметры: 
// 
Процедура ЗаполнитьНачальныеНастройки(ТолькоТекст = Ложь) Экспорт

	Если НЕ Болезни и НЕ Командировки и НЕ Отпуска и НЕ Прогулы Тогда
		Болезни = Истина;
		Командировки = Истина;
		Отпуска = Истина;
		Прогулы = Истина;
	КонецЕсли;	
	
	мКодОтчета = ПолучитьКодОтчета();
	
	мСписокОтборы = Новый СписокЗначений;
	мСписокГруппировки = Новый СписокЗначений;
	
	// Пустой период - без ограничения
	Если ДатаНач = '00010101000000' И ДатаКон = '00010101000000' Тогда
		ТекстОграничениеПериода = "";
	Иначе
		Если ДатаНач = '00010101000000' Тогда
			ТекстОграничениеПериода = "Период <= &ДатаКон";
		ИначеЕсли ДатаКон = '00010101000000' Тогда
			ТекстОграничениеПериода = "Период >= &ДатаНач";
		Иначе
			ТекстОграничениеПериода = "Период МЕЖДУ &ДатаНач И &ДатаКон";
		КонецЕсли;
	КонецЕсли; 

		
	Если мКодОтчета = мОрганизация Тогда
		
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	Основная.Сотрудник КАК Работник,
			|	Основная.Регистратор,
			|	Основная.НачалоИнтервала,
			|	Основная.КонецИнтервала,
			|	РаботникиОрганизации.ПодразделениеОрганизации КАК Подразделение,
			|	РаботникиОрганизации.Должность,
			|	РаботникиОрганизации.Организация КАК Организация,
			|	Основная.Серия
			|ИЗ (";
			
			ТекстПоСостояниям = "";
			
			Если Болезни Тогда 
				ТекстПоСостояниям = ТекстПоСостояниям + "
				|
				|ВЫБРАТЬ
				|	Сотрудник,
				|	Регистратор,
				|	НачалоИнтервала,
				|	КонецИнтервала,
				|	""Болеет"" КАК Серия
				|ИЗ
				|	(" + ПолучитьТекстОсновнойВыборкиДляВидаДиаграммы(мКодОтчета,"Болеет",ТекстОграничениеПериода) + ") КАК Болезни";
			КонецЕсли;
			
			Если Отпуска Тогда 
			   Если ТекстПоСостояниям <> "" Тогда 
			       ТекстПоСостояниям = ТекстПоСостояниям + "
				    |
					|ОБЪЕДИНИТЬ ВСЕ";
				КонецЕсли;
				ТекстПоСостояниям = ТекстПоСостояниям + "
				|
				|ВЫБРАТЬ
				|	Сотрудник,
				|	Регистратор,
				|	НачалоИнтервала,
				|	КонецИнтервала,
				|	""ВОтпуске"" КАК Серия
				|ИЗ
				|	(" + ПолучитьТекстОсновнойВыборкиДляВидаДиаграммы(мКодОтчета,"ВОтпуске",ТекстОграничениеПериода) + ") КАК ОтпускаЕжегодные			
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	Сотрудник,
				|	Регистратор,
				|	НачалоИнтервала,
				|	КонецИнтервала,
				|	""ВОтпускеПрочем"" КАК Серия
				|ИЗ
				|	(" + ПолучитьТекстОсновнойВыборкиДляВидаДиаграммы(мКодОтчета,"ВОтпускеПрочем",ТекстОграничениеПериода) + ") КАК ОтпускаПрочие			
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	Сотрудник,
				|	Регистратор,
				|	НачалоИнтервала,
				|	КонецИнтервала,
				|	""ВОтпускеБезОплаты"" КАК Серия
				|ИЗ
				|	(" + ПолучитьТекстОсновнойВыборкиДляВидаДиаграммы(мКодОтчета,"ВОтпускеБезОплаты",ТекстОграничениеПериода) + ") КАК ОтпускаБезОплаты			
				|";
			КонецЕсли;
			
			Если Прогулы Тогда 
			   Если ТекстПоСостояниям <> "" Тогда 
			       ТекстПоСостояниям = ТекстПоСостояниям + "
				    |
					|ОБЪЕДИНИТЬ ВСЕ";
				КонецЕсли;
				ТекстПоСостояниям = ТекстПоСостояниям + "
				|
				|ВЫБРАТЬ
				|	Сотрудник,
				|	Регистратор,
				|	НачалоИнтервала,
				|	КонецИнтервала,
				|	""Прогул"" КАК Серия
				|ИЗ
				|	(" + ПолучитьТекстОсновнойВыборкиДляВидаДиаграммы(мКодОтчета,"Прогул",ТекстОграничениеПериода) + ") КАК Прогулы";
			КонецЕсли;	
			
			Если Командировки Тогда 
			   Если ТекстПоСостояниям <> "" Тогда 
			       ТекстПоСостояниям = ТекстПоСостояниям + "
				    |
					|ОБЪЕДИНИТЬ ВСЕ";
				КонецЕсли;
				ТекстПоСостояниям = ТекстПоСостояниям + "
				|
				|ВЫБРАТЬ
				|	Сотрудник,
				|	Регистратор,
				|	НачалоИнтервала,
				|	КонецИнтервала,
				|	""Командировка"" КАК Серия
				|ИЗ
				|	(" + ПолучитьТекстОсновнойВыборкиДляВидаДиаграммы(мКодОтчета,"Командировка",ТекстОграничениеПериода) + ") КАК Прогулы";
			КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + ТекстПоСостояниям + "
			|) КАК Основная
			|";
				
			ТекстЗапроса = 	ТекстЗапроса +"
			|{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаСведений) КАК РаботникиОрганизации
			|ПО РаботникиОрганизации.Сотрудник = Основная.Сотрудник}
			|
			|{ГДЕ 
			|	РаботникиОрганизации.Организация КАК Организация,
			|	РаботникиОрганизации.ПодразделениеОрганизации.* КАК Подразделение,
			|	РаботникиОрганизации.Должность.* КАК Должность,
			|	Основная.Сотрудник.* КАК Работник,
			|	Основная.Регистратор КАК Регистратор
			|	}
			|
			|{УПОРЯДОЧИТЬ ПО 
			|	РаботникиОрганизации.Организация КАК Организация,
			|	РаботникиОрганизации.ПодразделениеОрганизации.* КАК Подразделение,
			|	РаботникиОрганизации.Должность.* КАК Должность,
			|	Основная.Сотрудник.* КАК Работник}
			|
			|{ИТОГИ  ПО 
			|	РаботникиОрганизации.Организация КАК Организация,
			|	РаботникиОрганизации.ПодразделениеОрганизации КАК Подразделение, 
			|	РаботникиОрганизации.Должность КАК Должность,
			|	Основная.Сотрудник КАК Работник}";
			
			мСписокГруппировки.Добавить("Организация");
			мСписокГруппировки.Добавить("Подразделение");
			мСписокГруппировки.Добавить("Работник");
			мСписокОтборы.Добавить("Организация");
			мСписокОтборы.Добавить("Подразделение");
			мСписокОтборы.Добавить("Работник");
			
	Иначе
		ТекстПоСостояниям = "";
			
		Если Болезни Тогда 
			ТекстПоСостояниям = ТекстПоСостояниям + "
			|
			|ВЫБРАТЬ
			|	Сотрудник,
			|	Регистратор,
			|	НачалоИнтервала,
			|	КонецИнтервала,
			|	""Болеет"" КАК Серия
			|ИЗ
			|	(" + ПолучитьТекстОсновнойВыборкиДляВидаДиаграммы(мКодОтчета,"Болеет",ТекстОграничениеПериода) + ") КАК Болезни";
		КонецЕсли;
		
		Если Отпуска Тогда 
		   Если ТекстПоСостояниям <> "" Тогда 
		       ТекстПоСостояниям = ТекстПоСостояниям + "
			    |
				|ОБЪЕДИНИТЬ ВСЕ";
			КонецЕсли;
			ТекстПоСостояниям = ТекстПоСостояниям + "
			|
			|ВЫБРАТЬ
			|	Сотрудник,
			|	Регистратор,
			|	НачалоИнтервала,
			|	КонецИнтервала,
			|	""ВОтпуске"" КАК Серия
			|ИЗ
			|	(" + ПолучитьТекстОсновнойВыборкиДляВидаДиаграммы(мКодОтчета,"ВОтпуске",ТекстОграничениеПериода) + ") КАК ОтпускаЕжегодные			
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Сотрудник,
			|	Регистратор,
			|	НачалоИнтервала,
			|	КонецИнтервала,
			|	""ВОтпускеПрочем"" КАК Серия
			|ИЗ
			|	(" + ПолучитьТекстОсновнойВыборкиДляВидаДиаграммы(мКодОтчета,"ВОтпускеПрочем",ТекстОграничениеПериода) + ") КАК ОтпускаПрочие			
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Сотрудник,
			|	Регистратор,
			|	НачалоИнтервала,
			|	КонецИнтервала,
			|	""ВОтпускеБезОплаты"" КАК Серия
			|ИЗ
			|	(" + ПолучитьТекстОсновнойВыборкиДляВидаДиаграммы(мКодОтчета,"ВОтпускеБезОплаты",ТекстОграничениеПериода) + ") КАК ОтпускаБезОплаты			
			|";
		КонецЕсли;
			
		Если Прогулы Тогда 
		   Если ТекстПоСостояниям <> "" Тогда 
		       ТекстПоСостояниям = ТекстПоСостояниям + "
			    |
				|ОБЪЕДИНИТЬ ВСЕ";
			КонецЕсли;
			ТекстПоСостояниям = ТекстПоСостояниям + "
			|
			|ВЫБРАТЬ
			|	Сотрудник,
			|	Регистратор,
			|	НачалоИнтервала,
			|	КонецИнтервала,
			|	""Прогул"" КАК Серия
			|ИЗ
			|	(" + ПолучитьТекстОсновнойВыборкиДляВидаДиаграммы(мКодОтчета,"Прогул",ТекстОграничениеПериода) + ") КАК Прогулы";
		КонецЕсли;	
		
		Если Командировки Тогда 
		   Если ТекстПоСостояниям <> "" Тогда 
		       ТекстПоСостояниям = ТекстПоСостояниям + "
			    |
				|ОБЪЕДИНИТЬ ВСЕ";
			КонецЕсли;
			ТекстПоСостояниям = ТекстПоСостояниям + "
			|
			|ВЫБРАТЬ
			|	Сотрудник,
			|	Регистратор,
			|	НачалоИнтервала,
			|	КонецИнтервала,
			|	""Командировка"" КАК Серия
			|ИЗ
			|	(" + ПолучитьТекстОсновнойВыборкиДляВидаДиаграммы(мКодОтчета,"Командировка",ТекстОграничениеПериода) + ") КАК Прогулы";
		КонецЕсли;

			
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	Основная.НачалоИнтервала,
			|	Основная.КонецИнтервала,
			|	Основная.Регистратор,
			|	Основная.Сотрудник КАК Работник,
			|	Работники.Подразделение КАК Подразделение,
			|	Работники.Должность,
			|	Основная.Серия КАК Серия
			|ИЗ
			|	(" + ТекстПоСостояниям + ") КАК Основная";
			
		ТекстЗапроса = ТекстЗапроса + " 
			|
			|{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Работники.СрезПоследних(&ДатаСведений) КАК Работники
			|ПО Работники.ФизЛицо = Основная.Сотрудник.ФизЛицо}
			|
			|{ГДЕ 
			|	Работники.Подразделение.* КАК Подразделение,
			|	Работники.Должность.* КАК Должность,
			|	Основная.Сотрудник.* КАК Работник,
			|	Основная.Регистратор КАК Регистратор}
			|
			|{УПОРЯДОЧИТЬ ПО Работники.Подразделение.* КАК Подразделение,
			|	Работники.Должность.* КАК Должность,
			|	Основная.Сотрудник.* КАК Работник }
			|
			|{ИТОГИ  ПО 
			|	Работники.Подразделение КАК Подразделение, 
			|	Основная.Сотрудник КАК Работник, 
			|	Работники.Должность КАК Должность}";
			
		мСписокГруппировки.Добавить("Подразделение");
		мСписокГруппировки.Добавить("Работник");
		мСписокОтборы.Добавить("Подразделение");
		мСписокОтборы.Добавить("Работник");
			
	КонецЕсли;

	ПостроительОтчета.Текст = ТекстЗапроса;
	
	ПостроительОтчета.ИзмеренияСтроки.Очистить();
	// Установим группировки по умолчанию
	Для Каждого ЭлементСписка Из мСписокГруппировки Цикл
		ПостроительОтчета.ИзмеренияСтроки.Добавить(ЭлементСписка.Значение);
	КонецЦикла;
    	
	Если Не ТолькоТекст Тогда
	
		// Очистим прежние настройки отчета
		ПостроительОтчета.Порядок.Очистить();
		Пока ПостроительОтчета.Отбор.Количество()>0 Цикл
			ПостроительОтчета.Отбор.Удалить(0);
		КонецЦикла; 
		
		
		// Установим отборы по умолчанию
		Для Каждого ЭлементСписка Из мСписокОтборы Цикл
			ПостроительОтчета.Отбор.Добавить(ЭлементСписка.Значение);
		КонецЦикла;
		
		// Периодичноть по умолчанию
		Периодичность = мДеньНеделяМесяц;
	КонецЕсли;	
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//
Процедура СформироватьОтчет(ДиаграммаГанта) Экспорт

    мКодОтчета = ПолучитьКодОтчета();
	
	Если Периодичность < 0 ИЛИ Периодичность > 3 Тогда
		Предупреждение(НСтр("ru='Не выбрана периодичность!';uk='Не обрана періодичність!'"));
		Возврат;
	КонецЕсли;
	
	Если ДатаНач > ДатаКон И ДатаКон <> '00010101000000' Тогда
		Предупреждение(НСтр("ru='Дата начала периода не может быть больше даты конца периода';uk='Дата початку періоду не може бути більше дати кінця періоду'"));
		Возврат;
	КонецЕсли; 

	Если ПостроительОтчета.ИзмеренияСтроки.Количество() = 0 Тогда
		Предупреждение(НСтр("ru='Не выбрано ни одной группировки!';uk='Не вибрано жодного групування!'"));
		Возврат;
	КонецЕсли;

	Если ДатаНач <> Дата('00010101') Тогда
		ДатаНач = НачалоДня(ДатаНач);
	КонецЕсли; 
	Если ДатаКон <> Дата('00010101') Тогда
		ДатаКон = КонецДня(ДатаКон);
	КонецЕсли; 
	
	//РезультатЗапроса = СформироватьЗапрос(Регистратор);
	ПостроительОтчета.Параметры.Вставить("ДатаНач", НачалоДня(ДатаНач));
	ПостроительОтчета.Параметры.Вставить("ДатаКон", НачалоМинуты(КонецДня(ДатаКон)));
	ПостроительОтчета.Параметры.Вставить("ДатаСведений", ДатаКон);
	ПостроительОтчета.Параметры.Вставить("ДатаПослеНачала", ДатаНач + 1);
	ПостроительОтчета.Параметры.Вставить("ТекущаяДата", КонецДня(РабочаяДата));

    ПостроительОтчета.Параметры.Вставить("Болеет", Перечисления.СостоянияРаботникаОрганизации.Заболевание);
	ПостроительОтчета.Параметры.Вставить("ВОтпуске", Перечисления.СостоянияРаботникаОрганизации.ОтпускЕжегодный);
	ПостроительОтчета.Параметры.Вставить("ВОтпускеПрочем", Перечисления.СостоянияРаботникаОрганизации.ОтпускПрочий);
	ПостроительОтчета.Параметры.Вставить("ВОтпускеБезОплаты", Перечисления.СостоянияРаботникаОрганизации.ОтпускБезСохраненияЗарплаты);
	ПостроительОтчета.Параметры.Вставить("Прогул", Перечисления.СостоянияРаботникаОрганизации.ОтсутствуетПоНевыясненнойПричине);
	ПостроительОтчета.Параметры.Вставить("Командировка", Перечисления.СостоянияРаботникаОрганизации.Командировка);

	ПостроительОтчета.Выполнить();
	РезультатЗапроса = ПостроительОтчета.Результат;
	
	ДиаграммаГанта.Обновление = Ложь;
	ДиаграммаГанта.Очистить();
	
	//ДиаграммаГанта.ОбластьЗаголовка.Текст = СформироватьЗаголовок();
	
	// Оформление шкалы времени
	ЭлементыШкалыВремени = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы;
	
	// очистим коллекцию
	ПервыйЭлемент = ЭлементыШкалыВремени[0];// нельзя полностью очитить коллекцию (один элемент будет всегда)
	Для Н=1 по ЭлементыШкалыВремени.Количество()-1 Цикл
		ЭлементыШкалыВремени.Удалить(ЭлементыШкалыВремени[1]);
	КонецЦикла; 
	
	// заполним коллекцию
	Если Периодичность = мДеньНеделяМесяц Тогда
		
		ПервыйЭлемент.Единица = ТипЕдиницыШкалыВремени.Месяц;
		ПервыйЭлемент.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Сплошная, 1);
		
		Элемент = ЭлементыШкалыВремени.Добавить();
		Элемент.Единица = ТипЕдиницыШкалыВремени.Неделя;
		Элемент.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Точечная, 1);
		
		Элемент = ЭлементыШкалыВремени.Добавить();
		Элемент.Единица = ТипЕдиницыШкалыВремени.День;
		Элемент.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Пунктир, 1);
		Элемент.ФорматДня =  ФорматДняШкалыВремени.ДеньМесяца;
		
	ИначеЕсли Периодичность = мЧасДень Тогда
		
		ПервыйЭлемент.Единица = ТипЕдиницыШкалыВремени.День;
		ПервыйЭлемент.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Сплошная, 1);
		ПервыйЭлемент.ФорматДня =  ФорматДняШкалыВремени.ДеньМесяца;
		
		Элемент = ЭлементыШкалыВремени.Добавить();
		Элемент.Единица = ТипЕдиницыШкалыВремени.Час;
		Элемент.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Точечная, 1);
		
	ИначеЕсли Периодичность = мНеделяМесяцГод Тогда
		
		ПервыйЭлемент.Единица = ТипЕдиницыШкалыВремени.Год;
		ПервыйЭлемент.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Сплошная, 1);
		
		Элемент = ЭлементыШкалыВремени.Добавить();
		Элемент.Единица = ТипЕдиницыШкалыВремени.Месяц;
		Элемент.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Точечная, 1);
		
		Элемент = ЭлементыШкалыВремени.Добавить();
		Элемент.Единица = ТипЕдиницыШкалыВремени.Неделя;
		Элемент.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Пунктир, 1);
		
	ИначеЕсли Периодичность = мМесяцГод Тогда
		
		ПервыйЭлемент.Единица = ТипЕдиницыШкалыВремени.Год;
		ПервыйЭлемент.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Сплошная, 1);
		
		Элемент = ЭлементыШкалыВремени.Добавить();
		Элемент.Единица = ТипЕдиницыШкалыВремени.Месяц;
		Элемент.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Точечная, 1);
	КонецЕсли;

	КодЯзыкаПечать = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	
	// Вывод данных
	СтруктураПараметров = Новый Структура;
	ДиаграммаГанта.ОтображатьПустыеЗначения = Ложь;
	СтруктураПараметров.Вставить("Диаграмма", ДиаграммаГанта);
	СтруктураПараметров.Вставить("ВсегоГруппировок", ПостроительОтчета.ИзмеренияСтроки.Количество());
	
//	Если мКодОтчета = мОрганизация Тогда	
		Если Болезни Тогда
			СтруктураПараметров.Вставить("СерияБолеет", ДиаграммаГанта.УстановитьСерию(НСтр("ru='Болезнь';uk='Хвороба'", КодЯзыкаПечать)));
		КонецЕсли;
		Если Командировки Тогда
			СтруктураПараметров.Вставить("СерияКомандировка", ДиаграммаГанта.УстановитьСерию(НСтр("ru='Командировка';uk='Відрядження'", КодЯзыкаПечать)));
		КонецЕсли;
		Если Отпуска Тогда
			СтруктураПараметров.Вставить("СерияВОтпуске", ДиаграммаГанта.УстановитьСерию(НСтр("ru='Ежегодный отпуск';uk='Щорічна відпустка'", КодЯзыкаПечать)));
			СтруктураПараметров.Вставить("СерияВОтпускеБезОплаты", ДиаграммаГанта.УстановитьСерию(НСтр("ru='Отпуск без оплаты';uk='Відпустка без оплати'", КодЯзыкаПечать)));
			СтруктураПараметров.Вставить("СерияВОтпускеПрочем", ДиаграммаГанта.УстановитьСерию(НСтр("ru='Прочий отпуск';uk='Інша відпустка'", КодЯзыкаПечать)));
		КонецЕсли;
		Если Прогулы Тогда
			СтруктураПараметров.Вставить("СерияПрогул", ДиаграммаГанта.УстановитьСерию(НСтр("ru='Отсутствие по невыясненной причине';uk=""Відсутність з нез'ясованої причини""", КодЯзыкаПечать)));
		КонецЕсли;	
//	КонецЕсли; 
	
	ВывестиВыборку(РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам), СтруктураПараметров, 0);
	
	ДиаграммаГанта.ПоказатьУровеньТочек(0);
	ДиаграммаГанта.Обновление = Истина;
	
КонецПроцедуры // СформироватьОтчет()

// Выводим диаграмму отчета в табличный длокумент
Процедура Печать(Регистратор = "") Экспорт
	
	Если ЗначениеЗаполнено(Регистратор) Тогда
		Если ПостроительОтчета.Отбор.Найти("Регистратор") = Неопределено Тогда
			ПостроительОтчета.Отбор.Добавить("Регистратор");
		КонецЕсли; 
		ПостроительОтчета.Отбор.Регистратор.Значение = Регистратор;
		ПостроительОтчета.Отбор.Регистратор.Использование = Истина;
	КонецЕсли; 
	
	ДокументРезультат = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьДиаграмма = Макет.ПолучитьОбласть("ОбластьДиаграммы");
	
	// Заполним заголовок отчета
	Если ДатаНач = '00010101000000' И ДатаКон = '00010101000000' Тогда
		СтрПериод = "без ограничения ";
	Иначе
		Если ДатаНач = '00010101000000' ИЛИ ДатаКон = '00010101000000' Тогда
			СтрПериод = Формат(ДатаНач, "ДФ = ""дд.ММ.гггг""; ДП = ""без ограничения""") 
			+ " - " + Формат(ДатаКон, "ДФ = ""дд.ММ.гггг""; ДП = ""без ограничения""");
		Иначе
			СтрПериод = ПредставлениеПериода(НачалоДня(ДатаНач), КонецДня(ДатаКон));
		КонецЕсли;
	КонецЕсли;

	СписокОтбор = "";
	Для Сч=0 По ПостроительОтчета.Отбор.Количество()-1 Цикл
		Если ПостроительОтчета.Отбор[Сч].Использование Тогда
			СписокОтбор = СписокОтбор +", "+ ПостроительОтчета.Отбор[Сч].Представление 
			+" "+ ПостроительОтчета.Отбор[Сч].ВидСравнения +" "+ ПостроительОтчета.Отбор[Сч].Значение;
		КонецЕсли; 
	КонецЦикла; 

	СписокГруппировок = "";
	Для Сч=0 По ПостроительОтчета.ИзмеренияСтроки.Количество()-1 Цикл
		СписокГруппировок = СписокГруппировок +", "+ ПостроительОтчета.ИзмеренияСтроки[Сч].Представление
		+" "+ ПостроительОтчета.ИзмеренияСтроки[Сч].ТипИзмерения;
	КонецЦикла; 
	
	ОбластьЗаголовок.Параметры.ЗаголовокОтчета = ВидОтчета;
	ОбластьЗаголовок.Параметры.Период     = "Период: "+СтрПериод;
	ОбластьЗаголовок.Параметры.Отбор      = "Отбор:"    +Сред(СписокОтбор,2);
	ОбластьЗаголовок.Параметры.Группировки  = НСтр("ru='Группировки по: ';uk='Групування по: '")+Сред(СписокГруппировок,2);
	ДокументРезультат.Вывести(ОбластьЗаголовок);
	
	// Выводим диаграмму
	ДокументРезультат.Вывести(ОбластьДиаграмма);
	СформироватьОтчет(ДокументРезультат.Рисунки.Диаграмма.Объект);
	
	УниверсальныеМеханизмы.НапечататьДокумент(ДокументРезультат, ,, НСтр("ru='Диаграмма: ';uk='Діаграма: '") + ВидОтчета);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
// 
// виды периодичностей. Номера соответсвуют значению Периодичность
мЧасДень 			= 0;
мДеньНеделяМесяц	= 1;
мНеделяМесяцГод		= 2;
мМесяцГод		    = 3;

// Коды отчета
мОрганизация		= 1;
мПредприятие		= 2;


мТаблицаВидыОтчета = Новый ТаблицаЗначений;
мТаблицаВидыОтчета.Колонки.Добавить("ВидОтчета", ОбщегоНазначения.ПолучитьОписаниеТиповСтроки(100));
мТаблицаВидыОтчета.Колонки.Добавить("КодОтчета", ОбщегоНазначения.ПолучитьОписаниеТиповЧисла(2));

// Соответствие видов отчета и их кодов
НоваяСтрока = мТаблицаВидыОтчета.Добавить();
НоваяСтрока.ВидОтчета = НСтр("ru='По работникам организаций';uk='По працівниках організацій'");
НоваяСтрока.КодОтчета = мОрганизация;

НоваяСтрока = мТаблицаВидыОтчета.Добавить();
НоваяСтрока.ВидОтчета = НСтр("ru='По работникам предприятия';uk='По працівниках підприємства'");
НоваяСтрока.КодОтчета = мПредприятие;

мИмяОтчета = Метаданные().Имя;

#КонецЕсли
